# Дана некоторая строка со словами:

# 'aaa bbb ccc'
# Сделайте заглавным первый символ каждого слова в этой строке. 
# В нашем случае должно получится следующее:

# 'Aaa Bbb Ccc'

st = 'aaa bbb ccc'

new = st.title()

print(new)
