# Дан словарь:

# {
#	'a': 1,
#	'b': 2,
#	'c': 3, 
#	'd': 4,
#}
#Получите список его ключей:

# ['a', 'b', 'c', 'd']

dic = {
    'a': 1,
    'b': 2,
    'c': 3,
    'd': 4
}

val = list(dic.keys())

print(val)
