# Дан словарь:

# {
#	'a': 1,
#	'b': 2,
#	'c': 3, 
#	'd': 4,
#}
# Получите сет его значений:

# {1, 2, 3, 4}

dic = {
	'a': 1,
	'b': 2,
	'c': 3, 
	'd': 4,
    }

s = set(dic.values())

print(s)
