# Дана строка:

# 'abcdef'
# Получите каждый второй символ этой строки:

st = 'abcdef'

print(st[::2])
