# Дан список с дробями:

# [1.456, 2.125, 3.32, 4.1, 5.34]
# Округлите эти дроби до одного знака в дробной части.

lst = [1.456, 2.125, 3.32, 4.1, 5.34]

one_dec = []

for l in lst:
    a = round(l, 1)
    one_dec.append(a)

print(one_dec)
