# Дано некоторое число:

# 12345
# Выведите в консоль все его символы с конца.

digit = 12345
st_digi = str(digit)

print(int(st_digi[::-1]))
